class Question {

    question;
    options;
    currectOption;

    constructor(question,options,currectOption){
        this.question = question;
        this.options = options;
        this.currectOption = currectOption;
    }

    checkIfCurrect(option){
        if(option==this.currectOption){
            return true;
        }
        return false;
    }
}
const  questions  =  [
  {
    "question": "اختر الاجابة الاولى وتربح هذه الجولة ",
    "options":[
      "انا لست الثاني",
       "انا لست الاول",
       "كلنا اوائل",
       "انا الاخير صدقوني"
    ],
    "currectOption": null
  },{
  "question": "هل بيوت الشِِعر تنكسر",
  "options":[
    "نعم اذا كانت فقط ! مبنية على الزجاج",
     "لا هي تنهدم لا تنكسر",
     "نعم ولكن ليست دائما",
     "استسلم لا اريد الاستمرار"
  ],
  "currectOption": 0
},{
  "question": "هنالك اربعة شبان اثنين معهم عصي , الاثنان الذين معهم عصي ضربوا الذين ليس معهم عصي ضربا مبرحا , بم ان الاثنين ضربوا فكم ناتج اثنين ضرب اثنين",
  "options":[
    "اربعة",
     "اثنين",
     "اثنين واربعة",
     "اكره الرياضيات لا اريد الاستمرار"
  ],
  "currectOption": 2
},{
  "question": "اختر الشكل الذي تعتقد ان الاكثرية سوف يختارونه",
  "options":[
"◥◤",
"෴",
"ω",
"っ"
  ], 
  "currectOption": 0 ,

},{
  "question": "هل تريد الاستمرار",
  "options":[
    "نعم",
     "لا",
     "سوف افكر",
     "ابدا"
  ],
  "currectOption": 0,
  "sp" : true
},{
  "question": "  ذهب  جد وابوان و ابن الى شباك تذاكر المباريات كم عدد التذاكر التي شروها,  اقل حد ممكن بحيث الكل يملك تذكرة واحدة على الاكثر",
  "options":[
    "6",
     "5",
     "4",
     "3"
  ],
  "currectOption": 0
},{
  "question": " طبيب وسائق حافلة يحبان نفس المرأة، وهي فتاة جميلة اسمها تفاحة . كان على سائق الحافلة الذهاب في رحلة حافلة طويلة تستغرق أسبوعًا. لكن قبل أن يغادر، أعطى تفاحة سبع تفاحات. لماذا؟ ",
  "options":[
    "تفاحة يوميا تغنيك عن الطبيب",
     "لان اسمها تفاحة ",
     "تعبيرا عن مجموع الايام التي يقضيها",
     "لا يهمني الامر"
  ],
  "currectOption": 3
},{
  "question": "اتحداك تحلها , متى استقلت الأردن؟ ",
  "options":[
    "1964",
     "1945",
     "1954",
     "1946"//this
  ],
  "currectOption": 0
},
{
  "question": "اضغط على الرجل ",
  "options":[
    "👨",
     "🦶🏻",//this
  ],
  "currectOption":3
},{
  "question": "اذا كان احمد كابتن طائرة , فإن نفي نفي النفي للعبارة هي ",
  "options":[
    "احمد كابتن سفينة",
     "احمد ليس كابتن طائرة",//this
     "احمد كابتن طائرة",
     "احمد ليس ليس كابتن طائرة"
  ],
  "currectOption": 1
},{
  "question": "ما هو الشيء الذي يأتي بدون مطرقة ولا يمكن لأي شخص العيش بدونه؟",
  "options":[
    "الماء",
     "الهواء",
     "الطعام",
     "النوم"//this
  ],
  "currectOption": 1
},{
  "question": "ما هو الشيء الذي تستطيع إسقاطه دون كسره أو تكسيره، ولكن إذا إسقطته من الطابق العاشر سينكسر بالتأكيد",
  "options":[
    "الماء",
     "الزجاج",
     "الرمل",
     "الهواء"//this
  ],
  "currectOption": 1
},{
  "question": "لو كنت وحيدًا في غرفة مع قارورة وكان لديك فقط مشبك واحد، فكيف تستطيع الخروج من الغرفة",
  "options":[
    "تستخدم المشبك لفتح الباب",
     "تستخدم المشبك لكسر القارورة وتستخدم الزجاج لقطع الباب",
     "تستخدم المشبك لتحطيم الباب",
     "لا يمكن الخروج من الغرفة فعليك الانتظار حتى يأتي شخص آخر"//this
  ],
  "currectOption": 3
},{
  "question": "ما هو الشيء الذي يراه الناس كل يوم ولكن لا يرونه في المرآة؟",
  "options":[
    "الشمس",
     "الساعة",
     "الظل",
     "الكلمات"//this
  ],
  "currectOption": 0
},{
  "question": "ما هو الشيء الذي يمشي بأربعة أرجل في الصباح، بثلاثة أرجل في الظهيرة، وباثنين في المساء",
  "options":[
    "الإنسان",
     "الكلب",
     "الحصان",
     "الضفدع"//this
  ],
  "currectOption": 2
},
{
  "question": "ما هو الشيء الذي تستطيع الوقوف عليه ولكنك لا تستطيع الوقوف عليه مدى الحياة",
  "options":[
    "الجسر",
     "السرير",
     "السلم",
     "الثلج"//this
  ],
  "currectOption": 0
},
{
  "question": "ما هو الشيء الذي يأتي مرة في الدقيقة، مرتين في اللحظة، ولا يأتي مرة في الساعة",
  "options":[
    "الثانية",
     "الدقيقة",
     "اللحظة",
     "الساعة"//this
  ],
  "currectOption": 3
},
{
  "question": "",
  "options":[
    "",
     "",
     "",
     ""//this
  ],
  "currectOption": 0
},

]


// const questions = [
//     new Question("lorem lorem" , ["yasir" , "ali" , "Areen" , "khalid"] , 0),
//     new Question("what is my name2" , ["yasir" , "ali" , "Areen" , "khalid"] , 0),
//     new Question("what is my name3" , ["yasir" , "ali" , "Areen" , "khalid"] , 2)]

const q =  [
    {
      "question": "ما هي الحيوانات التي تحتوي على أكبر عدد من الأسنان؟",
      "options":[
         "الفيل",
         "القرش",
         "الحوت الأحدب",
         "الكلب"
      ],
      "currectOption": "a"
    },
    {
      "question": "ما هي الحيوانات التي تعيش فقط في أستراليا؟",
      "options":[
         "الكنغر",
         "البومة الأسترالية",
         "الكوالا",
         "الكركدن"
      ],
      "currectOption": 0
    },
    {
      "question": "ما هو البحر الذي يحتوي على أعلى مستوى للملوحة في العالم؟",
      "options":[
         "بحر الميت",
         "بحر البلطيق",
         "بحر الأعشاب",
         "بحر اليابان"
      ],
      "currectOption": 2
    },
    {
      "question": "ما هي أعلى قمة في العالم؟",
      "options":[
         "إفرست",
         "كيليمنجارو",
         "جبل فينسون",
         "جبل ماكينلي"
      ],
      "currectOption": 0
    },
    {
      "question": "ما هي الدولة التي ينبعث منها نهر الأمازون؟",
      "options":[
         "البرازيل",
         "بيرو",
         "كولومبيا",
         "إكوادور"
      ],
      "currectOption": 0
    },
    {
      "question": "ما هو الحيوان الذي يمكنه النوم لمدة تصل إلى 3 سنوات؟",
      "options":[
         "الدببة",
         "الخفافيش",
         "السحالي",
         "السنجاب"
      ],
      "currectOption": 0
    },
    {
      "question": "ما هو عدد الكواكب في المجموعة الشمسية؟",
      "options":[
         "7",
         "9",
         "12",
         "8"
      ],
      "currectOption": 2
    },{
      "question": " ",
      "options":[
        "",
         "",
         "",
         ""
      ],
      "currectOption": null
    },
]